{
    "url": "https://www.appdome.com/how-to/securing-workplace-apps/mobile-enterprise-access-and-microvpn/achieve-secure-remote-mobile-app-access-with-microvpn",
    "title": "How to Achieve Secure Remote Mobile App Access with MicroVPN",
    "content": "How to Achieve Secure Remote Mobile App Access with MicroVPN\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n![](https://pubads.g.doubleclick.net/activity;xsp=4798079;ord=1?)\n\n\n\n ![](https://px.ads.linkedin.com/collect/?pid=3167484&fmt=gif)\n\n\n\n\nMenu\n\n[Sign In](https://fusion.appdome.com/login)\n\n[![Appdome Logo](https://www.appdome.com/wp-content/uploads/elementor/thumbs/appdome-logo-r88bnmyou58sjra0z25z48awn6epdjpr0vb010dhxc.png \"Appdome Logo\")](/)\n\n[How to](https://www.appdome.com/how-to/) \n > \n[Securing Workplace Apps](https://www.appdome.com/how-to/securing-workplace-apps/)\n > \n[Mobile Enterprise Access and MicroVPN](https://www.appdome.com/how-to/securing-workplace-apps/mobile-enterprise-access-and-microvpn/)\n > \n[How to Achieve Secure Remote Mobile App Access with MicroVPN](https://www.appdome.com/how-to/securing-workplace-apps/mobile-enterprise-access-and-microvpn/achieve-secure-remote-mobile-app-access-with-microvpn/)\n\n# How to Achieve Secure Remote Mobile App Access with MicroVPN\n\nLast updated December 31, 2023 by Appdome\n\nMicroVPNs are virtual private networks that are specific to an application instead of a device. The purpose of using a MicroVPN in mobile apps is to enable Bring Your Own Device (BYOD) and avoid deploying a VPN client to every device. MicroVPNs allow mobile apps to establish direct and seamless access to corporate resources without a VPN on the device. This Knowledge Base explains how anyone can use Appdome to achieve secure remote mobile access with MicroVPN.\n\n## How to Achieve Secure Remote Mobile App Access with MicroVPN\n\nAppdome is a no-code mobile app security platform designed to add security features in mobile apps.\n\nAppdome’s no-code mobile app security platform offers mobile developers, DevSec and security professionals a convenient and reliable way to protect Android and iOS apps without coding. When a user clicks “Build My App,” Appdome leverages a microservice architecture filled with 1000s of security plugins, and an adaptive code generation engine that matches the correct required plugins to the development environment, frameworks, and methods in each app.\n\nUsing Appdome, there are no development or coding prerequisites to build secured apps. There is no SDK and no library to manually code or implement in the app. The Appdome technology adds the relevant standards, frameworks, stores, and logic to the app automatically, with no manual development work at all.\n\nAppdome MicroVPN is a flexible, all-in-one, mobile enterprise connectivity solution that supports any enterprise standard network gateway such as an SSL gateway, proxy, reverse proxy, or industry standard VPN. Appdome MicroVPN eliminates the need for mobile device VPNs or per application VPNs. Using Appdome MicroVPN each mobile app connects directly and securely to enterprise infrastructures.\n\nAppdome’s MicroVPN does not require all web service endpoints to be published via a gateway or code change to apps to repoint to the newly published addresses of services. Appdome’s MicroVPN can use any SSL gateway, including Microsoft App Proxy, Netscaler and more in two main modes: transparent mode which does not require resources to be publicly published, and reverse proxy mode which is intended for publicly resolvable resources. Modes can also be set on a per resource basis, providing full granular control over the access and connectively model.\n\nUsing Appdome, there are no development or coding prerequisites. For example, there is no Appdome SDK, libraries, or plug-ins to implement. Likewise, there are no required infrastructure changes and no dependency on having standard or proprietary VPN protocols inside the mobile apps. The Appdome technology adds MicroVPN and relevant standards, protocols and more to the mobile app automatically.\n\n### Appdome for Mobile MicroVPN offers two modes:\n\nOn Appdome, you can enable a mobile app to use MicroVPN in two different modes of operation:\n\n1. **Direct Connection Mode (default)**  \n   In this mode, the Appdome MicroVPN layer will act as a secure gateway between the application and the world. Inside the Appdome-Built application, the original application connects to the Appdome MicroVPN layer. This internal connection is protected by Appdome Security and not visible to the outside world. The Appdome MicroVPN Layer connects securely to the corporate gateway. The Appdome MicroVPN layer authenticates to the corporate gateway, enabling secure mobile app access to internal resources.\n2. **Transparent Proxy Mode:**  \n   In this mode, the Appdome MicroVPN layer routes its connection request to a proxy server, so that the proxy server can act as the secure gateway. Corporate proxies are typically accessible via the Internet. The Appdome MicroVPN layer tunnels a secure connection to the proxy to allow the original application to privately connect to the corporate network.\n\n### Appdome for Mobile MicroVPN Features:\n\n**Inclusive Routing**\n\nInclusive routing means you can decide that only some domains (regular expressions can be used) are securely connected using MicroVPN, while other connections that are not included in the domain list are allowed to pass directly. This gives you the option to choose particular settings different domains, which is especially useful for defining multiple profiles with different configurations.\n\n**Session Hardening**\n\nThe most straightforward way of ensuring that connections between mobile apps and corporate networks are secure is to restrict the parameters of the connection. Appdome allows you to control two important parts of the connection used by the Appdome MicroVPN layer.\n\n1. **Strict Protocol Checking**, only connections to protocols in a pre-defined list are permitted. This prevents connections from the built application to less secure destinations from being established.\n2. **Server Validation**, after establishing a connection to a destination, the Appdome-fused app can do advanced checks to verify that the destination is who it says it is and is not a fake or malicious destination that impersonates your destination.\n\nWhen **Strict Protocol Checking** is enabled, built apps will only be able to make connections to secure servers using these algorithms:\n\nDHE-RSA-AES256-GCM-SHA384, DHE-RSA-AES128-GCM-SHA256, ECDHE-RSA-AES256-GCM-SHA384, ECDHE-RSA-AES128-GCM-SHA256, DHE-RSA-AES256-SHA256, DHE-RSA-AES128-SHA256, ECDHE-RSA-AES256-SHA384, ECDHE-RSA-AES128-SHA256.\n\n**Static Client Pinning**\n\nA more advanced security measure is to apply restrictions on the server or gateway which is the destination for the mobile app. If you set up the server or gateway to only accept connections from clients that can identify themselves using specific client certificates, Appdome can integrate the certificates needed to identify the client and present them as part of the secured connections.\n\n**Dynamic Client Pinning**\n\nDynamic client pinning is an enterprise extension for static client pinning. It allows the use of a unique client-side certificate distributed by a SCEP server on a per-user basis. Currently, users are identified when fusing an app together with MicroVPN and Microsoft [Intune](https://www.appdome.com/how-to/byod-zero-trust/no-code-microsoft-intune/make-mobile-apps-work-intune-microvpn/). For more details read this [article](https://www.appdome.com/how-to/byod-zero-trust/no-code-microsoft-intune/use-microsoft-scep-certificates-intune-app-sdk/).\n\n**Profiles**\n\nAppdome allows you to define one or more profiles to configure all the above settings. In this manner, you can protect some domains with Static Client Pinning, while protecting others by securing them using Transparent Proxy mode. Note: When using multiple profiles, all the profiles should be set up with Inclusive Routing in order to have the handling of each domain well defined.\n\n### Prerequisites for adding MicroVPN by Appdome\n\nIn order to use Appdome’s no code implementation of MicroVPN on Appdome, you’ll need:\n\n* [Appdome account](https://fusion.appdome.com/) – IDEAL or Higher.\n* [Mobile App](https://www.appdome.com/how-to/dev-sec-tools/how-appdome-works/begin-no-code-mobile-app-security-project/) (.ipa for iOS, or .apk or .aab for Android)\n* Enterprise-grade SSL gateway, proxy, reverse proxy, or industry standard VPN that is the authentication or termination endpoint for the MicroVPN\n* List of internal domains the mobile app will access\n* Client-side certificates (PEM+key) for Static Client Pinning\n* [Signing Credentials](https://www.appdome.com/how-to/dev-sec-tools/how-appdome-works/how-to-sign-my-app-on-appdome/) (e.g., signing certificates and provisioning profile)\n\n## **9 Easy Steps** to Achieve Secure Remote Mobile App Access with MicroVPN\n\nFollow these step-by-step instructions to add MicroVPN to mobile apps on Appdome:\n\n### Upload a Mobile App to Your Account\n\nPlease follow these steps to [add a mobile app to your Appdome account](https://www.appdome.com/how-to/dev-sec-tools/how-appdome-works/begin-no-code-mobile-app-security-project/).\n\nIf you don’t have an Appdome account, [click here to create an account](https://fusion.appdome.com/signup).\n\n### From the “Build” tab, select “Access” category\n\n1. Go to the **Access** tab\n2. Toggle on **Mobile Access and MicroVPN Profiles**\n3. Select scheme **MicroVPN by Appdome****Note!** that all the features are optional, and any combination can be chosen. If none of the features are on, Appdome will take basic measures to ensure connection hardening (by ensuring the application’s connection uses a secure TSL/SSL connection).\n4. Toggle on the Inclusive Routing feature when you can click **+ Add** button to add domains that will be protected. When this toggle is off all domains are protected (and you can only have a single profile). You can add multiple domains or use \\* as a wildcard that will match any sub-domain.\n5. Toggle on Transparent proxy mode and enter the proxy domain (can contain port in the standard format host:port)\n6. Toggle on session hardening to enable Strict Protocol Checking and/or Server Validation.\n7. Toggle on Static Client Pinning and add the client certificate. The certificate is added in PEM format as two separate files, the certificate itself and its key file.\n8. Click on Add profile to set up more profiles for your app\n9. Click **Build My App**\n\n![Adding MicroVPN to Mobile apps - No Code](https://www.appdome.com/wp-content/uploads/2018/10/Presentation2-2.png)\n\nThe technology behind Build My App has two major elements – (1) a micro service architecture filled with 1000s of code sets needed for mobile integrations, and (2) an adaptive code generation engine that can recognize the development environment, frameworks and methods in each app and match the app to the relevant code-sets needed to add MicroVPN to the mobile app in seconds.\n\n**Congratulations!** When your implementation is complete, you’ll see the notice below. You now have a mobile app fully integrated with MicroVPN.\n\n![Success Msg](https://www.appdome.com/wp-content/uploads/2018/10/Success_MSG-650x362.png)\n\n## After Adding MicroVPN to a Mobile App on Appdome\n\nAfter you have added MicroVPN to any mobile app on Appdome, there are a few additional steps needed to complete your mobile integration project.\n\n### Add Context™ to the Appdome-Built App\n\nAppdome is a full featured mobile integration platform. Within Context™, Appdome users can brand the app, including adding a favicon to denote the new service added to the application.  \nFor more information on the range of options available in Context™, please read this [knowledge base article](https://www.appdome.com/how-to/dev-sec-tools/app-sec-release-automation/update-app-icon-branding-secured-android-ios-apps ).\n\n### Sign the MicroVPN enabled Appdome-Built App (Required)\n\nIn order to deploy an Appdome-Built application, it must be signed. [Signing iOS app](https://www.appdome.com/how-to/dev-sec-tools/signing-secured-apps/sign-secured-ios-apps-without-xcode ) and[Signing an Android app](https://www.appdome.com/how-to/dev-sec-tools/signing-secured-apps/sign-secured-android-apps-without-android-studio/) are easy using Appdome. Alternatively, you can use [Private Signing](https://www.appdome.com/how-to/dev-sec-tools/signing-secured-apps/securely-automate-ios-app-signing-cicd/), download your unsigned application and sign locally using your own signing methods.\n\n### Deploy the Appdome-Built App to a Mobile Device\n\nOnce you have signed your Appdome-Built application, you can download to deploy it using your distribution method of choice. For more information on deploying your Appdome-Built applications, please read [this knowledge base](https://www.appdome.com/how-to/dev-sec-tools/app-sec-release-automation/auto-publish-secured-android-ios-apps/).\n\nThat is it – Enjoy MicroVPN in your application!\n\n### **How Do I Learn More?**\n\nCheck out our Appdome [blog](https://www.appdome.com/dev-sec-blog/) or [request a demo](https://www.appdome.com/request-a-demo/) at any time.\n\nIf you have any questions, please send them our way at [support.appdome.com](http://support.appdome.com/) or via the chat window on the Appdome platform.\n\n### Thank you!\n\nThanks for visiting [**Appdome**](https://www.appdome.com/ \"https://www.appdome.com/\")! Our mission is to secure every app on the planet by making mobile app security easy. We hope we’re living up to the mission with your project. If you don’t already have an account, you can [sign up for free](https://fusion.appdome.com/ \"https://fusion.appdome.com/\").\n\nWant a Demo?\n\nMobile Enterprise Access and MicroVPN\n\n![](https://www.appdome.com/wp-content/uploads/2020/02/Appdome_Team_Photos_Gil_Hartman_BW.jpg)\n\nGilWe're here to help\n\n\n\n\nWe'll get back to you in 24 hours to schedule your demo.\n\n* [Home Page](https://www.appdome.com/)\n* [Dev+Sec Blog](https://www.appdome.com/dev-sec-blog/)\n* [Request A Demo](https://www.appdome.com/request-a-demo/appdome-home/)\n* [Platform](https://www.appdome.com/devsecops-tool-cicd/)\n* [Pricing](https://www.appdome.com/appdome-pricing/)\n* [About](https://www.appdome.com/about/)\n* [Patents](https://www.appdome.com/legal/patents/)\n* [Knowledge Base](https://www.appdome.com/how-to/)\n* [In The News](https://www.appdome.com/in-the-news/)\n* [Careers we’re hiring!](https://www.appdome.com/about/work-at-appdome/)\n* [Terms Of Use](https://www.appdome.com/legal/terms-of-use/)\n* [Press Releases](https://www.appdome.com/press-releases/)\n* [Privacy Policy](https://www.appdome.com/legal/privacy-policy/)\n* [Contact Us](https://www.appdome.com/contact-us/)\n\n\n\n---\n\nREDWOOD CITY OFFICE\n\n* 3 Twin Dolphin Drive,   \n  Suite 375 Redwood City,   \n  CA 94065\n* Phone: [+1.650.567.6100](tel:+16505676100)   \n  Mobile: [+1.844.360.FUSE (3873)](tel:+1844360FUSE (3873))   \n  Email: [info@appdome.com](mailto:info@appdome.com)\n\nISRAEL OFFICE\n\n* 21 HaArba'a Street,\n* Phone: [+97235568332](tel:+97235568332)   \n  Email: [info@appdome.com](mailto:info@appdome.com)\n\nSearch for:\n\nFollow us\n\n©2026 Appdome, Inc. All rights reserved. This Website requires the use of technical cookies and, with your consent, profiling, and third-party analytics to improve your experience.  \n If you continue to use our Website, or by clicking any items of our Website, you agree to this.\n\nWe use cookies to ensure that we give you the best experience on our website.\nIf you continue to use this site we will assume that you are happy with it.\nOk\n\n ![](https://px.ads.linkedin.com/collect/?pid=3167484&fmt=gif) \n\n## Search Appdome Solutions\n\nSearch\n\nSearch\n\n[![mobile app protection best practices](https://www.appdome.com/wp-content/uploads/2026/01/Mobile-App-Protection-Best-Practices-for-Developers-in-2026-170x111.png)](https://www.appdome.com/dev-sec-blog/mobile-app-protection-best-practices-for-developers/)\n\n### [Mobile App Protection Best Practices for Developers in 2026](https://www.appdome.com/dev-sec-blog/mobile-app-protection-best-practices-for-developers/)\n\nMobile app protection best practices for developers in 2026. Learn how to protect apps from AI malware, bots, ATO, and fraud — automated with Appdome.\n\nJan Sysmans \n\nJanuary 5, 2026\n\n[![Mobile App Attack Vectors](https://www.appdome.com/wp-content/uploads/2026/01/mobile-app-attack-vectors-170x111.png)](https://www.appdome.com/dev-sec-blog/top-mobile-app-attack-vectors/)\n\n### [Top 10 Mobile App Attack Vectors in 2026 And the Defense Architecture Required to Stop Them](https://www.appdome.com/dev-sec-blog/top-mobile-app-attack-vectors/)\n\nAI malware, deepfakes, and automated bots are the top mobile app attack vectors in 2026. Discover how to stop them with Appdome’s defense architecture defense.\n\nJan Sysmans \n\nJanuary 1, 2026\n\n[![G2 Customer Reviews](https://www.appdome.com/wp-content/uploads/2025/12/G2-Reviews_-2025-Was-a-Banner-Year-for-Appdome-170x111.png)](https://www.appdome.com/dev-sec-blog/g2-customer-reviews-2025-banner-year-appdome/)\n\n### [G2 Customer Reviews Reveal 2025 Was a Banner Year for Appdome](https://www.appdome.com/dev-sec-blog/g2-customer-reviews-2025-banner-year-appdome/)\n\nG2 customer reviews show that 2025 marked a pivotal year for Appdome. The platform gained momentum as enterprises standardized on AI-native automation for mobile security, fraud prevention, and bot defense.\n\nTom Tovar \n\nDecember 28, 2025\n\n[![Android Bootloader Integrity Explained](https://www.appdome.com/wp-content/uploads/2025/12/android-bootloader-integrity-explained-170x111.png)](https://www.appdome.com/dev-sec-blog/android-bootloader-integrity-explained/)\n\n### [Why ‘Unlocked Bootloader’ Is a Broken Android Security Model](https://www.appdome.com/dev-sec-blog/android-bootloader-integrity-explained/)\n\nAndroid bootloader integrity is often reduced to a locked or unlocked state. This article explains why that model fails and how contextual bootloader signals improve identity and session trust.\n\nLiron Dror \n\nDecember 24, 2025\n\n[Dev+Sec Blog](/dev-sec-blog)\n\n-->"
}