{
    "url": "https://www.appdome.com/how-to/securing-workplace-apps/enterprise-mobile-app-security/make-mobile-apps-work-with-intune-and-microvpn",
    "title": "How to Make Mobile Apps Work with Intune and MicroVPN",
    "content": "How to Make Mobile Apps Work with Intune and MicroVPN\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n![](https://pubads.g.doubleclick.net/activity;xsp=4798079;ord=1?)\n\n\n\n ![](https://px.ads.linkedin.com/collect/?pid=3167484&fmt=gif)\n\n\n\n\nMenu\n\n[Sign In](https://fusion.appdome.com/login)\n\n[![Appdome Logo](https://www.appdome.com/wp-content/uploads/elementor/thumbs/appdome-logo-r88bnmyou58sjra0z25z48awn6epdjpr0vb010dhxc.png \"Appdome Logo\")](/)\n\n[How to](https://www.appdome.com/how-to/) \n > \n[Securing Workplace Apps](https://www.appdome.com/how-to/securing-workplace-apps/)\n > \n[Enterprise Mobile App Security](https://www.appdome.com/how-to/securing-workplace-apps/enterprise-mobile-app-security/)\n > \n[How to Make Mobile Apps Work with Intune and MicroVPN](https://www.appdome.com/how-to/securing-workplace-apps/enterprise-mobile-app-security/make-mobile-apps-work-with-intune-and-microvpn/)\n\n# How to Make Mobile Apps Work with Intune and MicroVPN\n\nLast updated April 27, 2023 by Appdome\n\n[Microsoft Intune](https://www.appdome.com/enterprise-mobile-apps/enterprise-mobility/microsoft-intune//)is the leading MAM in the market today. Many companies are using, or are in the process of migrating from MDMs to MAM and to Microsoft Intune. In addition, organizations often require mobile apps and mobile app users to use secure network connectivity. MicroVPN allows a mobile app to securely connect to any standard SSL, VPN or Proxy enterprise gateway. This Knowledge Base explains how you can use Appdome to make mobile apps work with Intune and MicroVPN in seconds. From there, you can manage any mobile App using Microsoft Intune and secured its network connection.\n\nThanks for reading and we hope you find this article helpful.\n\n## How to Make Mobile Apps Work with Intune and MicroVPN\n\nMobile Apps need network connectivity to communicate with the outside world, including the servers and services needed for the App to function properly. Unfortunately, the public (not secured) networks pose the risk of data loss, data theft, identity theft, and more. Appdome MicroVPN is part of the**Mobile Access**category**.**It is a secure mobile access feature, unique to Appdome, which enables a mobile app to connect directly to any enterprise SSL, VPN, or Proxy gateway in a flexible, efficient, and secure manner.  Note that it’s not truly a VPN (It doesn’t tunnel the connection through a remote server), instead, it’s a component in the application itself that takes care to ensure secure connection parameters.  MicroVPN is an industry-standard term.\n\nAppdome’s MicroVPN does not require all web service endpoints to be published via a gateway or code change to apps to repoint to the newly published addresses of services. Appdome’s MicroVPN can use any SSL gateway, including Microsoft App Proxy, Netscaler and more in two main modes: **Transparent Proxy mode** which does not require resources to be publicly published, and **Direct Connection mode** which is intended for publicly resolvable resources. Modes can also be set on a per-resource basis, providing full granular control over the access and connectively model.\n\nAppdome for Microsoft Intune SDK Integration is one of the premier solutions available on Appdome. Using Appdome to **Build** Microsoft Intune and MicroVPN to mobile Apps is simple and fast. Once **Build** is complete, you can deploy the Built App directly to Intune and install the Built App on mobile devices via Intune. All data created within the App will be encrypted and protected inside a container, preventing other applications from accessing the App’s data. Furthermore, When the Built App initiates an SSL Handshake with the server, using MicroVPN, outgoing traffic will be processed to ensure the connection to the server is secure.  Appdome allows you to enjoy all the features the Microsoft Intune SDK offers as well as the additional security of [Appdome Mobility Suite](https://www.appdome.com/dev-sec-blog/guarantee-android-ios-compatibility-uem-mam/) and [BoostEMMTMby Appdome](https://www.appdome.com/how-to/mobile-app-security/no-code-mobile-app-security/boostemm-by-appdome/).\n\nUsing Appdome, there are no development or coding prerequisites. For example, there is no Appdome SDK, libraries, or plug-ins to implement. The iOS (.ipa) or Android (.apk or .aab) App can be built in any development environment such as xCode for iOS and Android Studio, or non-native environments like Maui, Xamarin, Cordova, and React Native. Likewise, there is no requirement to pre-build any part of the Microsoft Intune functionality, use the Microsoft wrapper, or implement Microsoft Intune SDK capabilities into Android or iOS Apps prior to using Appdome. Appdome’s technology adds the full Microsoft Intune SDK, as well as standards, methods or protocols necessary, to mobile Apps automatically. After using Appdome, mobile Apps will leverage the Microsoft Intune SDK capabilities as if they were natively coded into the App.\n\n### Prerequisites for Using Appdome for Microsoft Intune\n\n1. [Appdome account](https://fusion.appdome.com/) – IDEAL or Higher\n2. [Mobile App](https://www.appdome.com/how-to/dev-sec-tools/how-appdome-works/begin-no-code-mobile-app-security-project/) (.ipa for iOS, or .apk or .aab for Android)\n3. You have a configured and accessible instance of [Microsoft Intune](https://docs.microsoft.com/en-us/intune/account-sign-up) (to deploy your App).\n\n## 3 Easy Steps to Make Mobile Apps Work with Intune and MicroVPN\n\nTo Build your App with the Microsoft Intune SDK, follow these simple steps.  Note, the same workflow can be used for either an Android or iOS App.\n\n### From the “Build” tab, Add the Microsoft Intune SDK\n\n1. Select the **Build**tab**.***Note: a blue underline will appear showing the step is active*\n2. Select the **Management**category. *Note: a blue highlight will appear showing the category is active.*\n3. Toggle “ON”  **EMM Services**and **Select the Microsoft Intune SDK**  \n   ![Add Microsoft Intune and MicroVPN to any app using appdome - no coding](https://www.appdome.com/wp-content/uploads/2018/08/Screen-Shot-2019-02-22-at-2.35.22-PM.png)\n\n### Steps to Integrate MicroVPN\n\n1. Click the **Build** tab\n2. Click the **Appdome for****Access** category\n3. Enable**MicroVPN**  \n   ![Add Microsoft Intune and MicroVPN to any app using appdome - no coding](https://www.appdome.com/wp-content/uploads/2018/08/Screen-Shot-2019-02-22-at-2.41.30-PM.png)\n\n### Configuring the MicroVPN Profile\n\nFor full information regarding the profile configuration please read [Adding MicroVPN to Applications](/how-to/byod-zero-trust/cyber-security-compliance/achieve-secure-remote-mobile-app-access-microvpn/)\n\nMicroVPN profile configuration options:\n\n1. **Inclusive Routing** – If you want to route specific domains over MicroVPN you can specify the domains under Inclusive Routing.  \n   If you don’t enable Inclusive routing, all communication from the App is hardened. If you enable Inclusive Routing, communication to the domains you add will be hardened. All other traffic is permitted.\n   1. **Inclusion List** – If you enable Inclusive routing, you can add server hosts and domains one line add a time. Wildcards are permitted.\n2. **Transparent Proxy Mode** – Enable internal DNS resolution as well as a many-to-one relay via the standard Transparent Proxy protocol (HTTP CONNECT)\n   1. **Proxy Host** – If you enable Transparent Proxy Mode, you will need to specify the hostname of a proxy-relay.\n\n   ![appdome inclusive routing - Microsoft Intune and MicroVPN ](https://www.appdome.com/wp-content/uploads/2018/08/Screen-Shot-2019-02-22-at-2.46.37-PM.png)\n3. **Session Hardening** – The most straightforward way of ensuring that connections between mobile Apps and corporate networks are secure is to restrict the parameters of the connection by verifying the server certificates and protocols.\n   1. **Strict Protocol Checking** – When enabled, the Built App is prevented from connecting with un-secure servers.  \n      The Built App can connect only to Secure servers that use these algorithms: DHE-RSA-AES256-GCM-SHA384, DHE-RSA-AES128-GCM-SHA256, ECDHE-RSA-AES256-GCM-SHA384, ECDHE-RSA-AES128-GCM-SHA256, DHE-RSA-AES256-SHA256, DHE-RSA-AES128-SHA256, ECDHE-RSA-AES256-SHA384, ECDHE-RSA-AES128-SHA256.\n   2. **Server Validation** – Actively verify server certificate and trust chain for all connections through the MicroVPN service.\n4. **Static Client Pinning**  – This pinning allows client-side certificates to be added to the Built App for connecting with servers that require them.\n   1. **Custom Certificate .pem File** – Chose and Upload a client cert to use for authentication. The certificate file name must end in .pem.\n   2. **Custom Certificate .key File** – Chose and Upload the key for the client certificate. The key file name must end in .key.\n5. **Dynamic Client Pinning** – Pin a dynamic unique personal client certificate to the Built App to authenticate client connections on the MicroVPN gateway.\n   1. **SCEP Server URL** – Enter the URL of the Microsoft NDES server.\n\n![](https://www.appdome.com/wp-content/uploads/2018/08/Screen-Shot-2019-02-22-at-3.27.14-PM.png)\n\n### Build your App with Microsoft Intune and MicroVPN\n\nClick “**Build My App”** to complete Appdome’s Microsoft Intune SDK and the new profiled MicroVPN integration to the App.\n\nThe technology behind Build My App has two major elements – (1) a microservice architecture filled with 1000s of code sets needed for mobile integrations, and (2) an adaptive code generation engine that can recognize the development environment, frameworks and methods in each App and match the App to the relevant code-sets needed to add Microsoft Intune and MicroVPN to the mobile App in seconds.\n\n**Congratulations!** When your implementation is complete, you’ll see the notice below. You now have a mobile App fully integrated with Microsoft Intune and MicroVPN.  The App will be managed by Intune and have the ability to utilize a secure connection to backend corporate services.\n\n![](https://www.appdome.com/wp-content/uploads/2018/08/Screen-Shot-2019-02-22-at-3.42.48-PM.png)\n\n## After Building Your App with Microsoft Intune and MicroVPN\n\nAfter you have added Microsoft Intune and MicroVPN to your app, there are a few additional steps needed to complete your mobile integration project.\n\nPlease view the article here on [How to Complete My Mobile Integration Project After I Build My App](https://www.appdome.com/how-to/mobile-app-security/no-code-mobile-app-security/how-to-complete-your-mobile-app-integration-project-after-integrating-your-mobile-app-on-appdome/).\n\nHere’s an article on [How to Automatically Distribute Built Apps to Your Intune Environment.](https://www.appdome.com/how-to/byod-zero-trust/no-code-microsoft-intune/auto-publish-secure-enterprise-apps-built-intune/)\n\nThat is it – Enjoy your newly integrated mobile app!\n\n### How Do I Learn More?\n\nFor full information regarding the profile configuration please read here on [Building Applications with MicroVPN](/how-to/byod-zero-trust/cyber-security-compliance/achieve-secure-remote-mobile-app-access-microvpn/)\n\nTo zoom out on this topic, deploying mobile Apps fused with the Microsoft Intune SDK, read the [Appdome for Microsoft Intune datasheet](https://www.appdome.com/enterprise-mobile-apps/enterprise-mobility/microsoft-intune//)on our website.\n\nTo ensure your App is properly deployed with Microsoft Intune, make sure to visit [Deploying Mobile Apps Fused with the Microsoft Intune SDK](https://www.appdome.com/how-to/byod-zero-trust/no-code-microsoft-intune/publish-secure-enterprise-apps-built-intune-sdk/).\n\nIf you have any questions, please send them our way at [support@appdome.com](mailto:support@appdome.com) or via the chat window on the Appdome platform.\n\n### Thank you!\n\nThanks for visiting [Appdome](https://www.appdome.com/)! Our mission is to make mobile integration easy. We hope we’re living up to the mission with your project. If you don’t already have an account, you can [sign up for free](https://fusion.appdome.com/).\n\nWant a Demo?\n\nEnterprise Mobile App Security\n\n![](https://www.appdome.com/wp-content/uploads/2020/02/Appdome_Team_Photos_Gil_Hartman_BW.jpg)\n\nGilWe're here to help\n\n\n\n\nWe'll get back to you in 24 hours to schedule your demo.\n\n* [Home Page](https://www.appdome.com/)\n* [Dev+Sec Blog](https://www.appdome.com/dev-sec-blog/)\n* [Request A Demo](https://www.appdome.com/request-a-demo/appdome-home/)\n* [Platform](https://www.appdome.com/devsecops-tool-cicd/)\n* [Pricing](https://www.appdome.com/appdome-pricing/)\n* [About](https://www.appdome.com/about/)\n* [Patents](https://www.appdome.com/legal/patents/)\n* [Knowledge Base](https://www.appdome.com/how-to/)\n* [In The News](https://www.appdome.com/in-the-news/)\n* [Careers we’re hiring!](https://www.appdome.com/about/work-at-appdome/)\n* [Terms Of Use](https://www.appdome.com/legal/terms-of-use/)\n* [Press Releases](https://www.appdome.com/press-releases/)\n* [Privacy Policy](https://www.appdome.com/legal/privacy-policy/)\n* [Contact Us](https://www.appdome.com/contact-us/)\n\n\n\n---\n\nREDWOOD CITY OFFICE\n\n* 3 Twin Dolphin Drive,   \n  Suite 375 Redwood City,   \n  CA 94065\n* Phone: [+1.650.567.6100](tel:+16505676100)   \n  Mobile: [+1.844.360.FUSE (3873)](tel:+1844360FUSE (3873))   \n  Email: [info@appdome.com](mailto:info@appdome.com)\n\nISRAEL OFFICE\n\n* 21 HaArba'a Street,\n* Phone: [+97235568332](tel:+97235568332)   \n  Email: [info@appdome.com](mailto:info@appdome.com)\n\nSearch for:\n\nFollow us\n\n©2026 Appdome, Inc. All rights reserved. This Website requires the use of technical cookies and, with your consent, profiling, and third-party analytics to improve your experience.  \n If you continue to use our Website, or by clicking any items of our Website, you agree to this.\n\nWe use cookies to ensure that we give you the best experience on our website.\nIf you continue to use this site we will assume that you are happy with it.\nOk\n\n ![](https://px.ads.linkedin.com/collect/?pid=3167484&fmt=gif) \n\n## Search Appdome Solutions\n\nSearch\n\nSearch\n\n[![mobile app protection best practices](https://www.appdome.com/wp-content/uploads/2026/01/Mobile-App-Protection-Best-Practices-for-Developers-in-2026-170x111.png)](https://www.appdome.com/dev-sec-blog/mobile-app-protection-best-practices-for-developers/)\n\n### [Mobile App Protection Best Practices for Developers in 2026](https://www.appdome.com/dev-sec-blog/mobile-app-protection-best-practices-for-developers/)\n\nMobile app protection best practices for developers in 2026. Learn how to protect apps from AI malware, bots, ATO, and fraud — automated with Appdome.\n\nJan Sysmans \n\nJanuary 5, 2026\n\n[![Mobile App Attack Vectors](https://www.appdome.com/wp-content/uploads/2026/01/mobile-app-attack-vectors-170x111.png)](https://www.appdome.com/dev-sec-blog/top-mobile-app-attack-vectors/)\n\n### [Top 10 Mobile App Attack Vectors in 2026 And the Defense Architecture Required to Stop Them](https://www.appdome.com/dev-sec-blog/top-mobile-app-attack-vectors/)\n\nAI malware, deepfakes, and automated bots are the top mobile app attack vectors in 2026. Discover how to stop them with Appdome’s defense architecture defense.\n\nJan Sysmans \n\nJanuary 1, 2026\n\n[![G2 Customer Reviews](https://www.appdome.com/wp-content/uploads/2025/12/G2-Reviews_-2025-Was-a-Banner-Year-for-Appdome-170x111.png)](https://www.appdome.com/dev-sec-blog/g2-customer-reviews-2025-banner-year-appdome/)\n\n### [G2 Customer Reviews Reveal 2025 Was a Banner Year for Appdome](https://www.appdome.com/dev-sec-blog/g2-customer-reviews-2025-banner-year-appdome/)\n\nG2 customer reviews show that 2025 marked a pivotal year for Appdome. The platform gained momentum as enterprises standardized on AI-native automation for mobile security, fraud prevention, and bot defense.\n\nTom Tovar \n\nDecember 28, 2025\n\n[![Android Bootloader Integrity Explained](https://www.appdome.com/wp-content/uploads/2025/12/android-bootloader-integrity-explained-170x111.png)](https://www.appdome.com/dev-sec-blog/android-bootloader-integrity-explained/)\n\n### [Why ‘Unlocked Bootloader’ Is a Broken Android Security Model](https://www.appdome.com/dev-sec-blog/android-bootloader-integrity-explained/)\n\nAndroid bootloader integrity is often reduced to a locked or unlocked state. This article explains why that model fails and how contextual bootloader signals improve identity and session trust.\n\nLiron Dror \n\nDecember 24, 2025\n\n[Dev+Sec Blog](/dev-sec-blog)\n\n-->"
}