{
    "url": "https://www.appdome.com/how-to/securing-workplace-apps/enterprise-authentication-and-mobile-sso/use-enterprise-authentication-sso-in-mobile-apps",
    "title": "How to Use Enterprise Authentication (SSO) in Mobile Apps",
    "content": "How to Use Enterprise Authentication (SSO) in Mobile Apps\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n![](https://pubads.g.doubleclick.net/activity;xsp=4798079;ord=1?)\n\n\n\n ![](https://px.ads.linkedin.com/collect/?pid=3167484&fmt=gif)\n\n\n\n\nMenu\n\n[Sign In](https://fusion.appdome.com/login)\n\n[![Appdome Logo](https://www.appdome.com/wp-content/uploads/elementor/thumbs/appdome-logo-r88bnmyou58sjra0z25z48awn6epdjpr0vb010dhxc.png \"Appdome Logo\")](/)\n\n[How to](https://www.appdome.com/how-to/) \n > \n[Securing Workplace Apps](https://www.appdome.com/how-to/securing-workplace-apps/)\n > \n[Enterprise Authentication and Mobile SSO](https://www.appdome.com/how-to/securing-workplace-apps/enterprise-authentication-and-mobile-sso/)\n > \n[How to Use Enterprise Authentication (SSO) in Mobile Apps](https://www.appdome.com/how-to/securing-workplace-apps/enterprise-authentication-and-mobile-sso/use-enterprise-authentication-sso-in-mobile-apps/)\n\n# How to Use Enterprise Authentication (SSO) in Mobile Apps\n\nLast updated January 1, 2024 by Appdome\n\nSingle Sign-On (SSO) is an authentication method that allows a user to sign in to multiple applications with a single login credential.\n\nThis Knowledge Base article provides step-by-step instructions for how to use Enterprise Authentication (SSO) in Mobile apps using Appdome. We hope you find this knowledge base useful and enjoy using Appdome!\n\n## How to Use Enterprise Authentication (SSO) in Mobile Apps\n\nAppdome is a no-code mobile app security platform designed to add security features in mobile apps.\n\nAppdome’s no-code mobile app security platform offers mobile developers, DevSec and security professionals a convenient and reliable way to protect Android and iOS apps without coding. When a user clicks “Build My App,” Appdome leverages a microservice architecture filled with 1000s of security plugins, and an adaptive code generation engine that matches the correct required plugins to the development environment, frameworks, and methods in each app.\n\nUsing Appdome, there are no development or coding prerequisites to build secured apps. There is no SDK and no library to manually code or implement in the app. The Appdome technology adds the relevant standards, frameworks, stores, and logic to the app automatically, with no manual development work at all.\n\nLikewise, there are no required infrastructure changes and no dependency on SAML, OAuth, OpenID Connect or any other authentication standard inside the app. The Appdome technology adds any 3rd SSO service and relevant standards, frameworks and more to the app automatically, with no manual development work at all. Using Appdome, mobile apps will use the SSO service you selected to authenticate users as if the SSO service was natively coded to the app.\n\n### Key Definitions to Know Before Getting Started With Appdome for SSO\n\nA **protected resource** is any network resource that requires a mean of authentication in order to gain access. An app may try to access multiple resources which are governed by different authentication providers. To ensure seamless access, the SSO configuration allows to create a profile for each authentication provider profile and associate the protected resources it governs.\n\nOnce the app tries to access a protected resource, Appdome Single Sign-On will verify that the application is authorized. The application’s requests are considered unauthorized if the HTTP status code in the response from the protected resource differs from 200 (the standard HTTP code for success). If the request is unauthorized until the authentication process has completed all subsequent calls to the protected resource by the application will be stopped. This course of action maintains a good user experience since not all applications are equipped to handle unauthorized responses from protected resources (such as HTTP status code 401).\n\nWhen the authentication process initiates, a browser will launch automatically navigating to **Hub URL**. The user will be asked to enter credentials and upon successful authentication, the authentication provider will redirect the user to a predefined **Authentication Successful URI**. At this point, the authentication provider will supply a token that will be used later to access the **protected resource.** The token’s format may vary between authentication providers and methods, such as HTTP cookies, OpenID or proprietary formats.\n\n**Appdome’s Session Management** will add the authentication result, proof that the user is authorized to access the resource, to the application’s requests when needed to ensure that all requests are authenticated and able to access the protected resource. In addition, any event of authentication token or cookies expiration, Appdome Single Sign-On will kick into action to either extend the token expiration if possible or initiate the authentication browser again.\n\n## Prerequisites for Using Appdome for SSO\n\nIn order to use Appdome’s no code implementation of SSO on Appdome, you’ll need:\n\n* [Appdome account](https://fusion.appdome.com/)\n* [Mobile App](https://www.appdome.com/how-to/dev-sec-tools/how-appdome-works/begin-no-code-mobile-app-security-project/) (.ipa for iOS, or .apk or .aab for Android)\n* The Hub URL for the SSO Service\n* The Authentication Successful URI for the SSO Service\n* The Triggering URI for the SSO Service\n* Any Other SSO Service-specific information (see below)\n* [Signing Credentials](https://www.appdome.com/how-to/dev-sec-tools/how-appdome-works/how-to-sign-my-app-on-appdome/) (e.g., signing certificates and provisioning profile)\n\n## The Easy Steps to Use Enterprise Authentication (SSO) in Mobile Apps\n\nFollow these step-by-step instructions to add SSO to Any Mobile App:\n\n### Upload a Mobile App to Your Account\n\nPlease follow these steps to [add a mobile app to your Appdome account](https://www.appdome.com/how-to/dev-sec-tools/how-appdome-works/begin-no-code-mobile-app-security-project/).  \nIf you don’t have an Appdome account, [click here to create an account](https://fusion.appdome.com/signup).\n\n### From the “Build” tab, Enable Appdome for Single Sign-On\n\nSelect the **Build Tab**. *Note: a blue underline will appear showing the step is active*Beneath the Build Tab, you will find several service options. Select **Identity**. *Note: a blue highlight will appear showing the category is active.*\n\n* Click on the toggle to enable **Mobile Enterprise Authentication**\n* Choose an authentication provider from the list of predefined **Cloud Identity authentication** schemes or **Authentication Profiles** under **Appdome for Single Sign-On**\n\n![No-code Mobile SSO on appdome ](https://www.appdome.com/wp-content/uploads/2018/10/AppdomeSSO.png)\n\n* You can add multiple profiles configuring different authentication methods to different sets of resources. To learn more about Multiple Authentication Profiles, please refer to this [knowledge base article](https://www.appdome.com/how-to/byod-zero-trust/no-code-mobile-sso/use-multiple-authentication-profiles-mobile-apps/).\n* Configure the SSO service parameters:\n* **Hub URL**: **The URL to the authentication provider for the protected resource**\n  + For OpenID authentication, enter the service **Authorization Endpoint**\n  + Otherwise, enter the SSO service authentication **portal URL**\n* **Authentication Successful URI**: The URI that indicates that authentication is complete\n  + For OpenID authentication, this URI should be configured as one of the valid redirect URIs in the application profile.\n  + Otherwise, enter the return URI that the user will be redirected to, from the authentication portal, at the end of the authentication process.\n* **Protected Resource**: Add the list of URLs that needs authentication to be accessed (commonly, the URL for the service the app accesses). Appdome for Single Sign-On will kick into action only when a protected resource is not accessible due to unauthorized requests. You can add multiple URLs and the URLs support \\* as a wildcard.\n* **OpenID Authentication**: When toggling on OpenID authentication, the following fields will be revealed:\n  + **Client ID**: This is used to identify the application trying to authenticate against the SSO vendor’s service. This value is generated by the authentication party after creating an application profile.\n  + **Token URL**: The URL for the token request can be configured in case it was overridden (this will appear in the **Token Endpoint** field in the application configuration) or doesn’t comply with the following format https://my.hub.com/oauth/token. Otherwise, Appdome for Single Sign-On will set the correct URL according to the authentication party.\n  + **Client Secret**: If the client in the service uses a secret/key, enter it here.\n  + **Scopes**: This states the different services that the application will request access to with the token returned from the authentication process. The value supplied in this field should be a subset of the scopes configured in the application configuration in the authentication provider. If this value is omitted the default setting will be set according to the chosen authentication party.\n* Configure Advanced Features: several advanced features are available for finer control of irregular scenarios:\n* **Header Manipulation**:\n  + **Add Request Headers:** A list of header names and values to be added to any outgoing request from the app if the header name doesn’t already exist.\n  + **Remove Request Headers:** An outgoing request header matching any of the header names in this list will be removed before being sent to the server.\n  + **Override Request Headers:** A list of header names and values to be added to any outgoing request from the app. Existing values will be overridden.\n  + **Add Response Headers:** A list of header names and values to be added to any incoming response from the server if the header name doesn’t already exist.\n  + **Remove Response Headers:** An incoming response header matching any of the header names in this list will be removed before reaching the app.\n  + **Override Response Headers:** A list of header names and values to be added to any incoming response from the server. Existing values will be overridden.\n* **Cookies Groups:** A list of domains (allowing the use of the \\* wildcard) which will be sharing cookies. Any cookies set by the server for domains in the list will be saved regardless of the app’s logic. All cookies saved for the group will be added to outgoing requests matching any of these domains.\n* **Logout URLs**: A list of URLs (allowing use of the \\* wildcard) that when accessed by the app will cause all saved cookies to be cleared.\n* **Auto Persist Credentials** (iOS only): Persist credentials between sessions for applicable authentication schemes such as NTLM, without the use of cookies or access tokens.\n* **Reload App Webview** (iOS only): Automatically reload the app’s webview after an authentication success to access the desired resource.\n* **Reauthenticate On Redirect**: When enabled, even if the user authenticated himself before, he will be prompted to enter his credentials again on a redirect from a protected resource URL.\n* **Handle WebView Challenges** (Android only): Prompt the user for credentials directly from the app’s webview instead of creating a new authentication-only webview. Only applicable for apps in which a webview accesses the protected resource URLs.\n\nThe following KB articles include the details on how to add SSO to any mobile app per identity provider:\n\n* [Mobile Enterprise Authentication by Appdome](/how-to/byod-zero-trust/no-code-mobile-sso/use-modern-authentication-android-ios-apps/)\n* [OKTA Identity Cloud](/how-to/dev-sec-tools/how-appdome-works/no-code-okta-single-sign-on/)\n* [Azure Identity Cloud](/how-to/byod-zero-trust/no-code-microsoft-identity/build-mobile-apps-sso-microsoft-azure-ad/)\n* [Microsoft Active Directory Authentication Library (ADAL)](/how-to/byod-zero-trust/no-code-microsoft-identity/make-mobile-apps-work-ntlm-authentication/)\n* [Ping Identity Cloud](/how-to/dev-sec-tools/how-appdome-works/add-ping-sso-to-any-mobile-app-fast/)\n* [F5 Access Policy Manager](/how-to/dev-sec-tools/how-appdome-works/integrate-f5-apm/)\n\n### Appdome SSO+ Suite\n\nOnce you add Mobile SSO to your iOS or Android app, this set of unique features enables you to further manage and control SSO behavior for the Built app.\n\n1. **Session Management** (always on): Seamlessly manages and adds authentication cookies and/or tokens to the application’s request to protected resources to ensure successful access.\n2. [**In-App Private ID**](https://www.appdome.com/android-app/native-sso-mobile-apps-secure-by-design/): Encrypts cached ID information saved locally on the device to protect cookies, credentials and authentication information.\n3. **[Cross-app ID](https://www.appdome.com/how-to/byod-zero-trust/no-code-mobile-sso/share-authentication-between-android-ios-apps/):** Enables an enhanced app to share the authentication session with other Built apps. Once an app completes authentication, all other Built apps will be able to access the same protected resource without going through the authentication process.  You can control the scope of the shared ID: Sharing between all the apps Built by the account, or only the apps Built with a specific Fusion Set.\n   1. For OpenID, in order to share authentication between enhanced applications, the combination of the protected resource, Hub URL and client ID must be identical\n   2. Otherwise, when OpenID is not toggled, only the protected resource and Hub URL need to be identical\n4. **[Conditional Access](https://www.appdome.com/how-to/byod-zero-trust/no-code-mobile-sso/pass-sso-authentication-cookies-all-domains/)**: Auto populates app initiated traffic with authentication information (cookies and header).\n5. **[Conditional Cookies](https://www.appdome.com/how-to/byod-zero-trust/no-code-mobile-sso/use-conditional-authentication-cookies-mobile-apps/)**: Auto-populate authentication traffic with app information (cookies and HTTP headers).\n6. [**Direct Broker**](https://www.appdome.com/how-to/dev-sec-tools/how-appdome-works/direct-broker/): When this feature is toggled on, Appdome for Single Sign-On will track all domains redirected through the authentication browser and compare them to a predefined list of allowed domains. Any attempt to access an unapproved domain will stop the authentication process to ensure the integrity of private user information such as credentials and protected domains. You can specify a list of approved broker domains, to control for unauthorized redirects during authentication.\n\nWhen finished, click **Build My App.**\n\n**Congratulations!** You now have a mobile app fully integrated with Cross-App ID.\n\n![](https://www.appdome.com/wp-content/uploads/2018/10/Screen-Shot-2019-01-25-at-10.45.42-AM-1.png)\n\n## Building Custom SSO Workflows Inside Android and iOS Apps\n\nBuilding Single Sign-On inside Android and iOS apps involves several significant considerations. Perhaps the most significant consideration is “where” and “when” the SSO workflow will take place inside the app. Usually, an SSO workflow is initiated at the start of a login sequence. In this use case, the client and the server are built to handle the basic authentication sequence (User –> launches app –> enters credentials –> credentials verified by the server –> user issued a token or cookie allowing access to the app).\n\nBut, what if the app developer hasn’t or doesn’t want to build the app to support basic authentication? Or, what if the app developer wants more than the username and password provided in the basic authentication workflow (e.g., access to user details available in new authentication methods)? In these cases, Appdome-Threat Events provide a framework to pass user details contained in an OpenID and SAML authentication response to the app developer. This framework allows new flexibility to create custom SSO workflows inside an app using industry-standard methods to retrieve and pass user details between authentication services and mobile apps.\n\nOrganizations use their Identity Providers (IdPs) like Azure AD, Okta, Ping, etc. These authentication services usually connect on the backend to a store of user data and use SAML or OpenID to handle authentication requests. Using SAML and OpenID, applications have access to all the user and authentication details returned by the server backend (i.e. any data the backend implements).\n\nRead [this KB article](https://www.appdome.com/how-to/byod-zero-trust/no-code-mobile-sso/make-custom-mobile-sso-workflows-work-mobile-apps/) to learn how to build custom SSO workflows in your apps.\n\n## After Adding Enterprise Authentication (SSO) to Mobile Apps\n\nNow that you know how to add SSO to any mobile app on Appdome, there are a few additional steps needed to complete your mobile integration project.\n\n### Add Context™ to the Appdome-Built App\n\nAppdome is a full-featured mobile integration platform. Within Context™, Appdome users can brand the app, including adding a favicon to denote the new service added to the app.  \nFor more information on the range of options available in Context™, please read this [knowledge base article](https://www.appdome.com/how-to/dev-sec-tools/app-sec-release-automation/update-app-icon-branding-secured-android-ios-apps ).\n\n### Sign the Appdome Built App (Required)\n\nIn order to deploy an Appdome Built app, it must be signed. [Signing an iOS app](https://www.appdome.com/how-to/dev-sec-tools/signing-secured-apps/sign-secured-ios-apps-without-xcode/) and [Signing an Android app](https://www.appdome.com/how-to/dev-sec-tools/signing-secured-apps/sign-secured-android-apps-without-android-studio/) is easy using Appdome. Alternatively, you can use [Private Signing](https://www.appdome.com/how-to/dev-sec-tools/signing-secured-apps/securely-automate-ios-app-signing-cicd/), download your unsigned app and sign locally using your own signing methods.\n\n### Deploy the Appdome Built App to a Mobile Device\n\nOnce you have signed your Appdome Built app, you can download it to deploy it using your distribution method of choice. For more information on deploying your Appdome Built apps, please read [this knowledge base](https://www.appdome.com/how-to/dev-sec-tools/app-sec-release-automation/auto-publish-secured-android-ios-apps/).\n\nThat is it – Enjoy Appdome for Single Sign-On in your app!\n\n### How Do I Learn More?\n\nTo learn more about how you can add SSO to any mobile app, Check out Appdome for SSO+ [blog](https://www.appdome.com/dev-sec-blog/appdome-for-sso-a-better-way-to-add-sso-to-mobile-apps/) or [request a demo](https://www.appdome.com/request-a-demo/) at any time.\n\nPlease view our [video on Building app(s) with SSO here](https://youtu.be/v33FGm4LZy4).\n\nTo zoom out on this topic, visit  Appdome for [Mobile Identity](https://www.appdome.com/consumer-apps/mobile-authentication/mobile-mfa//) on our website.\n\nIf you have any questions, please send them our way at [support.appdome.com](http://support.appdome.com/) or via the chat window on the Appdome platform.\n\n### Thank you!\n\nThanks for visiting [**Appdome**](https://www.appdome.com/ \"https://www.appdome.com/\")! Our mission is to secure every app on the planet by making mobile app security easy. We hope we’re living up to the mission with your project. If you don’t already have an account, you can [sign up for free](https://fusion.appdome.com/ \"https://fusion.appdome.com/\").\n\nWant a Demo?\n\nEnterprise Authentication and Mobile SSO\n\n![](https://www.appdome.com/wp-content/uploads/2020/10/Alan_Bavosa_B.jpg)\n\nAlanWe're here to help\n\n\n\n\nWe'll get back to you in 24 hours to schedule your demo.\n\n* [Home Page](https://www.appdome.com/)\n* [Dev+Sec Blog](https://www.appdome.com/dev-sec-blog/)\n* [Request A Demo](https://www.appdome.com/request-a-demo/appdome-home/)\n* [Platform](https://www.appdome.com/devsecops-tool-cicd/)\n* [Pricing](https://www.appdome.com/appdome-pricing/)\n* [About](https://www.appdome.com/about/)\n* [Patents](https://www.appdome.com/legal/patents/)\n* [Knowledge Base](https://www.appdome.com/how-to/)\n* [In The News](https://www.appdome.com/in-the-news/)\n* [Careers we’re hiring!](https://www.appdome.com/about/work-at-appdome/)\n* [Terms Of Use](https://www.appdome.com/legal/terms-of-use/)\n* [Press Releases](https://www.appdome.com/press-releases/)\n* [Privacy Policy](https://www.appdome.com/legal/privacy-policy/)\n* [Contact Us](https://www.appdome.com/contact-us/)\n\n\n\n---\n\nREDWOOD CITY OFFICE\n\n* 3 Twin Dolphin Drive,   \n  Suite 375 Redwood City,   \n  CA 94065\n* Phone: [+1.650.567.6100](tel:+16505676100)   \n  Mobile: [+1.844.360.FUSE (3873)](tel:+1844360FUSE (3873))   \n  Email: [info@appdome.com](mailto:info@appdome.com)\n\nISRAEL OFFICE\n\n* 21 HaArba'a Street,\n* Phone: [+97235568332](tel:+97235568332)   \n  Email: [info@appdome.com](mailto:info@appdome.com)\n\nSearch for:\n\nFollow us\n\n©2026 Appdome, Inc. All rights reserved. This Website requires the use of technical cookies and, with your consent, profiling, and third-party analytics to improve your experience.  \n If you continue to use our Website, or by clicking any items of our Website, you agree to this.\n\nWe use cookies to ensure that we give you the best experience on our website.\nIf you continue to use this site we will assume that you are happy with it.\nOk\n\n ![](https://px.ads.linkedin.com/collect/?pid=3167484&fmt=gif) \n\n## Search Appdome Solutions\n\nSearch\n\nSearch\n\n[![mobile app protection best practices](https://www.appdome.com/wp-content/uploads/2026/01/Mobile-App-Protection-Best-Practices-for-Developers-in-2026-170x111.png)](https://www.appdome.com/dev-sec-blog/mobile-app-protection-best-practices-for-developers/)\n\n### [Mobile App Protection Best Practices for Developers in 2026](https://www.appdome.com/dev-sec-blog/mobile-app-protection-best-practices-for-developers/)\n\nMobile app protection best practices for developers in 2026. Learn how to protect apps from AI malware, bots, ATO, and fraud — automated with Appdome.\n\nJan Sysmans \n\nJanuary 5, 2026\n\n[![Mobile App Attack Vectors](https://www.appdome.com/wp-content/uploads/2026/01/mobile-app-attack-vectors-170x111.png)](https://www.appdome.com/dev-sec-blog/top-mobile-app-attack-vectors/)\n\n### [Top 10 Mobile App Attack Vectors in 2026 And the Defense Architecture Required to Stop Them](https://www.appdome.com/dev-sec-blog/top-mobile-app-attack-vectors/)\n\nAI malware, deepfakes, and automated bots are the top mobile app attack vectors in 2026. Discover how to stop them with Appdome’s defense architecture defense.\n\nJan Sysmans \n\nJanuary 1, 2026\n\n[![G2 Customer Reviews](https://www.appdome.com/wp-content/uploads/2025/12/G2-Reviews_-2025-Was-a-Banner-Year-for-Appdome-170x111.png)](https://www.appdome.com/dev-sec-blog/g2-customer-reviews-2025-banner-year-appdome/)\n\n### [G2 Customer Reviews Reveal 2025 Was a Banner Year for Appdome](https://www.appdome.com/dev-sec-blog/g2-customer-reviews-2025-banner-year-appdome/)\n\nG2 customer reviews show that 2025 marked a pivotal year for Appdome. The platform gained momentum as enterprises standardized on AI-native automation for mobile security, fraud prevention, and bot defense.\n\nTom Tovar \n\nDecember 28, 2025\n\n[![Android Bootloader Integrity Explained](https://www.appdome.com/wp-content/uploads/2025/12/android-bootloader-integrity-explained-170x111.png)](https://www.appdome.com/dev-sec-blog/android-bootloader-integrity-explained/)\n\n### [Why ‘Unlocked Bootloader’ Is a Broken Android Security Model](https://www.appdome.com/dev-sec-blog/android-bootloader-integrity-explained/)\n\nAndroid bootloader integrity is often reduced to a locked or unlocked state. This article explains why that model fails and how contextual bootloader signals improve identity and session trust.\n\nLiron Dror \n\nDecember 24, 2025\n\n[Dev+Sec Blog](/dev-sec-blog)\n\n-->"
}